package study;

public class Class0106 {
  /*
  * 클래스와 객체(인스턴스)를 설명(관계)
  * 실제 기능은 객체를
  * 객체생성: 클래스명 객체명 = new 생성자호출;
  * 클래스의 구성 요소 : 멤버변수, 메서드의 정의, 생성자
  * 클래스의 구성요소인 멤버변수와 메서드의 사용 방법
  * ->객체, 멤버변수, 객체.메서드호출
  * getter:클래스 안에 정의된 하나의 멤버변수의 값을 리턴하는 메서드
  * ->메서드명: get 멤버변수명
  * setter:클래스 안에 정의된 하나의 멤버변수의 값을 변경하는 메서드
  * ->메서드명: set 멤버변수명
  * 생성자(constructor)
  * -문법: public 클래스(매개변수들...){}
  * -역할: 클래스에 선언된 멤버변수의 값을 초기화할 용도
  * -클래스 안에 생성자가 하나도 없다면 default 생성자를 생성해 줌
  * default : public 클래스명(){}
  * 메서드처럼 오버로딩 가능
  * this 키워드
  * 접근제한자
  * -클래서, 멤버변수, 메서드 앞에 작성 가능
  * -접근 번위를 지정할 때 사용
  * -public : 같은 프로젝트 내에서는 접근 가능
  * -default : 같은 패키지라면 접근 가능
  * -protected
  * -private : 선언한 클래스 내에서만 접근가능
  * 결론: 멤버변수는 무조건 private, 메서드 public
  * */
}
